syaswanthkumar66-hash/iot/firmware/iotyk_esp32/main/main.cpp
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_random.h"
#include "config.h"
#include "certificates.h"
#include "nvs_manager.h"
#include "relay_controller.h"
#include "wifi_manager.h"
#include "ble_provision.h"
#include "local_server.h"
#include "mqtt_manager.h"
#include "driver/gpio.h"
#include <stdio.h>
#include <string.h>
#include <string>

#include "esp_idf_version.h"

// Only include driver header on ESP-IDF v5.0+ and newer targets (S3, C3, C6, etc)
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0) && !defined(CONFIG_IDF_TARGET_ESP32)
#include "driver/temperature_sensor.h"
#define HAS_TEMP_SENSOR 1
#else
#define HAS_TEMP_SENSOR 0
#endif

static const char* TAG = "APP_ORCH";
static bool is_serial_authenticated = false;
static bool s_ota_active = false;
static char s_serial_nonce[33] = {0};

typedef enum {
    SYSTEM_STATE_BLE_SETUP,     // Unprovisioned. BLE advertising slow blue blink, red off.
    SYSTEM_STATE_CONNECTING,    // WiFi connected, MQTT connecting. Blue solid, red blinks fast.
    SYSTEM_STATE_CONNECTED,     // Fully connected. Blue solid, red off.
    SYSTEM_STATE_WIFI_ERROR,    // WiFi connection failed. Blue off, red slow blink.
    SYSTEM_STATE_MQTT_ERROR,    // MQTT authentication rejected. Blue/Red police strobe.
    SYSTEM_STATE_LOCAL_ONLY,    // Local control operational but MQTT cloud links offline.
    SYSTEM_STATE_OTA_UPDATE     // Firmware OTA flashing. Red/Blue in phase 100ms blink.
} system_state_t;

static system_state_t s_system_state = SYSTEM_STATE_BLE_SETUP;

// Forward Declarations
std::string handle_command(const std::string& json_str);
void handle_serial_command(const char* line);
static void lock_uart_rx(void);

// Fallback dynamic device ID generator
static std::string get_fallback_device_id() {
    uint8_t mac[6];
    esp_efuse_mac_get_default(mac);
    char id[32];
    snprintf(id, sizeof(id), "iotyk-%02X%02X%02X%02X%02X%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return std::string(id);
}

// Memory-Safe Static JSON Parser: Reads string values without any heap allocations
static std::string get_json_val_static(const std::string& json, const std::string& key) {
    size_t kpos = json.find("\"" + key + "\"");
    if (kpos == std::string::npos) return "";
    size_t vpos = json.find(":", kpos);
    if (vpos == std::string::npos) return "";
    size_t s_quote = json.find("\"", vpos);
    if (s_quote != std::string::npos && s_quote < json.find_first_of(",}", vpos)) {
        size_t e_quote = json.find("\"", s_quote + 1);
        if (e_quote != std::string::npos) {
            return json.substr(s_quote + 1, e_quote - s_quote - 1);
        }
    } else {
        size_t end = json.find_first_of(",}", vpos);
        if (end != std::string::npos) {
            std::string raw = json.substr(vpos + 1, end - vpos - 1);
            size_t f = raw.find_first_not_of(" \t\r\n");
            size_t l = raw.find_last_not_of(" \t\r\n");
            if (f != std::string::npos && l != std::string::npos) {
                return raw.substr(f, l - f + 1);
            }
        }
    }
    return "";
}

// Unified Command Handler (Zero Dynamic Heap Memory Allocation)
std::string handle_command(const std::string& json_str) {
    // 1. OTA safety locks
    if (s_ota_active) {
        return "{\"e\":" + std::to_string(ERR_RELAY_BUSY) + "}";
    }

    ESP_LOGI(TAG, "Parsing payload statically...");

    // 2. Local WS Rate limiting checking
    static uint32_t command_count = 0;
    static uint32_t last_time = 0;
    uint32_t now = esp_log_timestamp();
    if (now - last_time < 1000) {
        command_count++;
        if (command_count > 10) {
            ESP_LOGW(TAG, "Rate limiting triggered! Dropping local frames.");
            return "{\"e\":" + std::to_string(ERR_RELAY_BUSY) + "}";
        }
    } else {
        command_count = 1;
        last_time = now;
    }

    // 3. Command Token Validation
    std::string token = get_json_val_static(json_str, "token");
    if (token.empty()) {
        token = get_json_val_static(json_str, "t");
    }

    io_tyk_config_t cfg;
    char stored_token[64] = {0};
    if (nvs_manager_load_config(&cfg) == ESP_OK && strlen(cfg.local_token) > 0) {
        strncpy(stored_token, cfg.local_token, sizeof(stored_token) - 1);
    } else {
        strncpy(stored_token, FACTORY_LOCAL_TOKEN, sizeof(stored_token) - 1);
    }

    // Constant-time check comparison
    int result = 0;
    if (token.length() != strlen(stored_token)) {
        result = 1;
    } else {
        for (size_t i = 0; i < token.length(); i++) {
            result |= (token[i] ^ stored_token[i]);
        }
    }

    if (result != 0) {
        ESP_LOGE(TAG, "Rejected unauthorized API call.");
        return "{\"e\":" + std::to_string(ERR_INVALID_TOKEN) + "}";
    }

    // 4. Action and Configuration Parsing
    std::string action = get_json_val_static(json_str, "action");
    if (action.empty()) {
        action = get_json_val_static(json_str, "a");
    }

    std::string relay_str = get_json_val_static(json_str, "relay");
    if (relay_str.empty()) {
        relay_str = get_json_val_static(json_str, "r");
    }
    int relay_id = relay_str.empty() ? -1 : atoi(relay_str.c_str());

    std::string power = get_json_val_static(json_str, "power");
    if (power.empty()) {
        power = get_json_val_static(json_str, "p");
    }

    // Update WiFi configuration credentials
    std::string new_ssid = get_json_val_static(json_str, "ssid");
    if (!new_ssid.empty()) {
        std::string new_pass = get_json_val_static(json_str, "password");
        
        io_tyk_config_t wifi_cfg;
        if (nvs_manager_load_config(&wifi_cfg) != ESP_OK) {
            memset(&wifi_cfg, 0, sizeof(io_tyk_config_t));
        }
        strncpy(wifi_cfg.wifi_ssid, new_ssid.c_str(), sizeof(wifi_cfg.wifi_ssid) - 1);
        strncpy(wifi_cfg.wifi_pass, new_pass.c_str(), sizeof(wifi_cfg.wifi_pass) - 1);
        nvs_manager_save_config(&wifi_cfg);

