syaswanthkumar66-hash/iot/firmware/iotyk_esp32/main/main.cpp
        ESP_LOGI(TAG, "WiFi config updated. Soft rebooting...");
        vTaskDelay(pdMS_TO_TICKS(1000));
        esp_restart();
    }

    int count = relay_controller_get_count();

    if (action == "RELAY_ON" || action == "t_on" || (relay_id == -1 && (power == "on" || power == "1"))) {
        ESP_LOGI(TAG, "Toggling ALL Relays ON");
        for (int i = 0; i < count; i++) {
            relay_controller_set_state(i, true);
        }
    } else if (action == "RELAY_OFF" || action == "t_off" || (relay_id == -1 && (power == "off" || power == "0"))) {
        ESP_LOGI(TAG, "Toggling ALL Relays OFF");
        for (int i = 0; i < count; i++) {
            relay_controller_set_state(i, false);
        }
    } else if (relay_id >= 1 && relay_id <= count) {
        bool s = (power == "on" || power == "1");
        relay_controller_set_state(relay_id - 1, s);
    }

    // Save Relay recovery mask state individually to preserve config flash cycles
    uint8_t state_mask = 0;
    for (int i = 0; i < count; i++) {
        if (relay_controller_get_state(i)) {
            state_mask |= (1 << i);
        }
    }
    nvs_manager_set_bool("r_mask", true); // restore flag active
    nvs_manager_set_bool("r_val_1", (state_mask & 1));
    nvs_manager_set_bool("r_val_2", (state_mask & 2));
    nvs_manager_set_bool("r_val_3", (state_mask & 4));
    nvs_manager_set_bool("r_val_4", (state_mask & 8));

    // 5. Build Flat Static Response String
    char d_id[64] = {0};
    nvs_manager_get_str(KEY_DEVICE_ID, d_id, sizeof(d_id), FACTORY_DEVICE_ID);
    if (strlen(d_id) == 0) strcpy(d_id, get_fallback_device_id().c_str());

    std::string states_str = "[";
    for (int i = 0; i < count; i++) {
        states_str += relay_controller_get_state(i) ? "1" : "0";
        if (i < count - 1) states_str += ",";
    }
    states_str += "]";

    char wifi_ssid[64] = {0};
    strncpy(wifi_ssid, cfg.wifi_ssid, sizeof(wifi_ssid) - 1);

    char resp_buf[256];
    snprintf(resp_buf, sizeof(resp_buf), "{\"id\":\"%s\",\"r_cnt\":%d,\"st\":%s,\"wifi_ssid\":\"%s\",\"cap\":{\"ota\":1,\"temp\":1,\"r4\":1}}",
             d_id, count, states_str.c_str(), wifi_ssid);

    return std::string(resp_buf);
}

#include "psa/crypto.h"

// Cryptographic verification of serial AUTH signature using FACTORY_LOCAL_TOKEN and boot nonce
static bool verify_serial_signature(const std::string& sig_hex) {
    if (sig_hex.length() < 64) return false;
    
    psa_crypto_init();

    psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_set_key_usage_flags(&attributes, PSA_KEY_USAGE_SIGN_MESSAGE);
    psa_set_key_algorithm(&attributes, PSA_ALG_HMAC(PSA_ALG_SHA_256));
    psa_set_key_type(&attributes, PSA_KEY_TYPE_HMAC);

    psa_key_id_t key_id = 0;
    psa_status_t status = psa_import_key(&attributes, 
                                         (const uint8_t*)FACTORY_LOCAL_TOKEN, 
                                         strlen(FACTORY_LOCAL_TOKEN), 
                                         &key_id);
    if (status != PSA_SUCCESS) {
        return false;
    }

    uint8_t hmac_buf[32];
    size_t mac_length = 0;
    status = psa_mac_compute(
        key_id,
        PSA_ALG_HMAC(PSA_ALG_SHA_256),
        (const uint8_t*)s_serial_nonce,
        32,
        hmac_buf,
        sizeof(hmac_buf),
        &mac_length
    );

    psa_destroy_key(key_id);

    if (status != PSA_SUCCESS) {
        return false;
    }

    char expected_hex[65] = {0};
    for (int i = 0; i < 32; i++) {
        sprintf(&expected_hex[i * 2], "%02x", hmac_buf[i]);
    }
    expected_hex[64] = '\0';

    int result = 0;
    for (size_t i = 0; i < 64; i++) {
        result |= (sig_hex[i] ^ expected_hex[i]);
    }
    return (result == 0);
}

// Serial Shell challenge-response receiver
void handle_serial_command(const char* line) {
    std::string cmd(line);
    if (cmd.empty()) return;

    if (cmd.rfind("AUTH:", 0) == 0) {
        std::string signature = cmd.substr(5);
        if (verify_serial_signature(signature)) {
            is_serial_authenticated = true;
            printf("AUTH_OK\n");
            ESP_LOGI(TAG, "Serial terminal successfully unlocked.");
        } else {
            is_serial_authenticated = false;
            printf("AUTH_FAILED\n");
            ESP_LOGW(TAG, "Invalid serial auth key matches.");
        }
    } else if (cmd == "STATUS") {
        printf("STATUS_OK\n");
        printf("--- DEVICE STATUS ---\n");
        
        char d_id[64] = {0};
        nvs_manager_get_str(KEY_DEVICE_ID, d_id, sizeof(d_id), FACTORY_DEVICE_ID);
        if (strlen(d_id) == 0) strcpy(d_id, get_fallback_device_id().c_str());
        printf("Device ID: %s\n", d_id);

        io_tyk_config_t cfg;
        bool has_wifi = (nvs_manager_load_config(&cfg) == ESP_OK && strlen(cfg.wifi_ssid) > 0);
        printf("Provisioned: %s\n", has_wifi ? "YES" : "NO");
        printf("WiFi Status: %s\n", wifi_manager_is_connected() ? "CONNECTED" : "DISCONNECTED");
        if (wifi_manager_is_connected()) {
            printf("SSID: %s\n", cfg.wifi_ssid);
            char ip[32] = {0};
            wifi_manager_get_ip(ip, sizeof(ip));
            printf("IP Address: %s\n", ip);
        }
        printf("MQTT Status: %s\n", mqtt_manager_is_connected() ? "CONNECTED" : "DISCONNECTED");
        printf("Local WS Status: %s\n", local_server_is_active() ? "ACTIVE" : "INACTIVE");
        printf("BLE Status: %s\n", ble_provision_is_active() ? "ADVERTISING" : "IDLE");
        printf("---------------------\n");
    } else if (cmd == "REAUTH") {
        is_serial_authenticated = false;
        printf("REAUTH_OK\n");
    } else if (cmd == "RESET") {
        printf("RESET_OK\n");
        vTaskDelay(pdMS_TO_TICKS(1000));
        esp_restart();
    } else {
        io_tyk_config_t check_cfg;
        bool has_config = (nvs_manager_load_config(&check_cfg) == ESP_OK && strlen(check_cfg.local_token) > 0);
        if (!is_serial_authenticated && has_config) {
            printf("SERIAL_UNAUTH\n");
            return;
        }

        if (cmd.rfind("PROV_PERM:", 0) == 0) {
            std::string json_str = cmd.substr(10);
            std::string d = get_json_val_static(json_str, "device_id");
            std::string u = get_json_val_static(json_str, "user");
            std::string p = get_json_val_static(json_str, "pass");
            std::string t = get_json_val_static(json_str, "token");
            std::string r_cnt = get_json_val_static(json_str, "r_cnt");

            if (!d.empty() && !u.empty() && !p.empty() && !t.empty()) {
                nvs_manager_set_str(KEY_DEVICE_ID, d.c_str());
                
                io_tyk_config_t prov_cfg;
                if (nvs_manager_load_config(&prov_cfg) != ESP_OK) {
                    memset(&prov_cfg, 0, sizeof(io_tyk_config_t));
                }
                strncpy(prov_cfg.temp_user, u.c_str(), sizeof(prov_cfg.temp_user) - 1);
                strncpy(prov_cfg.temp_pass, p.c_str(), sizeof(prov_cfg.temp_pass) - 1);
                strncpy(prov_cfg.local_token, t.c_str(), sizeof(prov_cfg.local_token) - 1);
                
                if (!r_cnt.empty()) {
                    strncpy(prov_cfg.r_cnt, r_cnt.c_str(), sizeof(prov_cfg.r_cnt) - 1);
                } else {
                    strcpy(prov_cfg.r_cnt, "1");
                }
                
                nvs_manager_save_config(&prov_cfg);

