syaswanthkumar66-hash/iot/firmware/iotyk_esp32/main/main.cpp
                printf("PROV_PERM_OK\n");
                vTaskDelay(pdMS_TO_TICKS(1000));
                esp_restart();
            } else {
                printf("PROV_PERM_FAILED: Missing fields\n");
            }
        } else if (cmd.rfind("PROV:", 0) == 0) {
            std::string json_str = cmd.substr(5);
            std::string s = get_json_val_static(json_str, "ssid");
            std::string p = get_json_val_static(json_str, "pass");
            std::string mu = get_json_val_static(json_str, "mqtt_u");
            std::string mp = get_json_val_static(json_str, "mqtt_p");
            std::string l = get_json_val_static(json_str, "l_tok");
            std::string r_cnt = get_json_val_static(json_str, "r_cnt");

            if (!s.empty()) {
                io_tyk_config_t prov_cfg;
                if (nvs_manager_load_config(&prov_cfg) != ESP_OK) {
                    memset(&prov_cfg, 0, sizeof(io_tyk_config_t));
                }
                strncpy(prov_cfg.wifi_ssid, s.c_str(), sizeof(prov_cfg.wifi_ssid) - 1);
                strncpy(prov_cfg.wifi_pass, p.c_str(), sizeof(prov_cfg.wifi_pass) - 1);
                strncpy(prov_cfg.temp_user, mu.c_str(), sizeof(prov_cfg.temp_user) - 1);
                strncpy(prov_cfg.temp_pass, mp.c_str(), sizeof(prov_cfg.temp_pass) - 1);
                strncpy(prov_cfg.local_token, l.c_str(), sizeof(prov_cfg.local_token) - 1);
                
                if (!r_cnt.empty()) {
                    strncpy(prov_cfg.r_cnt, r_cnt.c_str(), sizeof(prov_cfg.r_cnt) - 1);
                } else {
                    strcpy(prov_cfg.r_cnt, "4");
                }
                
                nvs_manager_save_config(&prov_cfg);

                printf("PROV_OK\n");
                vTaskDelay(pdMS_TO_TICKS(1000));
                esp_restart();
            } else {
                printf("PROV_FAILED: SSID missing\n");
            }
        } else if (cmd == "CLEAR_NVS" || cmd == "FACTORY_RESET") {
            nvs_manager_clear_all();
            printf("CLEAR_NVS_OK\n");
            vTaskDelay(pdMS_TO_TICKS(1000));
            esp_restart();
        } else {
            printf("UNKNOWN_COMMAND\n");
        }
    }
}

static void lock_uart_rx(void) {
    ESP_LOGW(TAG, "Device is fully provisioned. Shutting down serial RX interrupts for lock safety.");
    gpio_config_t io_conf = {};
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pin_bit_mask = (1ULL << GPIO_NUM_3); // Standard UART RX pin (GPIO 3)
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);
}

// Background Task handling Web Serial input buffering
static void serial_task(void* pvParameters) {
    char line[512];
    ESP_LOGI(TAG, "Serial command receiver task active.");
    while (true) {
        if (fgets(line, sizeof(line), stdin)) {
            size_t len = strlen(line);
            while (len > 0 && (line[len - 1] == '\r' || line[len - 1] == '\n')) {
                line[--len] = '\0';
            }
            if (len > 0) {
                handle_serial_command(line);
            }
        }
        vTaskDelay(pdMS_TO_TICKS(50));
    }
}

// Background task managing indicator LED blink speeds based on connection states
static void indicator_task(void* pvParameters) {
    while (true) {
        switch (s_system_state) {
            case SYSTEM_STATE_BLE_SETUP:
                indicator_led_set_red(false);
                indicator_led_set_blue(true);
                vTaskDelay(pdMS_TO_TICKS(500));
                indicator_led_set_blue(false);
                vTaskDelay(pdMS_TO_TICKS(500));
                break;
            case SYSTEM_STATE_CONNECTING:
                indicator_led_set_blue(true);
                indicator_led_set_red(true);
                vTaskDelay(pdMS_TO_TICKS(100));
                indicator_led_set_red(false);
                vTaskDelay(pdMS_TO_TICKS(100));
                break;
            case SYSTEM_STATE_CONNECTED:
                indicator_led_set_blue(true);
                indicator_led_set_red(false);
                vTaskDelay(pdMS_TO_TICKS(250));
                break;
            case SYSTEM_STATE_WIFI_ERROR:
                indicator_led_set_blue(false);
                indicator_led_set_red(true);
                vTaskDelay(pdMS_TO_TICKS(1000));
                indicator_led_set_red(false);
                vTaskDelay(pdMS_TO_TICKS(1000));
                break;
            case SYSTEM_STATE_MQTT_ERROR:
                indicator_led_set_red(true);
                indicator_led_set_blue(false);
                vTaskDelay(pdMS_TO_TICKS(100));
                indicator_led_set_red(false);
                indicator_led_set_blue(true);
                vTaskDelay(pdMS_TO_TICKS(100));
                break;
            case SYSTEM_STATE_LOCAL_ONLY:
                indicator_led_set_red(true);
                indicator_led_set_blue(false);
                vTaskDelay(pdMS_TO_TICKS(200));
                indicator_led_set_red(false);
                indicator_led_set_blue(true);
                vTaskDelay(pdMS_TO_TICKS(200));
                break;
            case SYSTEM_STATE_OTA_UPDATE:
                indicator_led_set_red(true);
                indicator_led_set_blue(true);
                vTaskDelay(pdMS_TO_TICKS(100));
                indicator_led_set_red(false);
                indicator_led_set_blue(false);
                vTaskDelay(pdMS_TO_TICKS(100));
                break;
        }
    }
}

// Background Monitor checking Heap Margins for long-term uptime stability
static void memory_monitor_task(void* pvParameters) {
    while (true) {
        size_t free_heap = heap_caps_get_free_size(MALLOC_CAP_8BIT);
        size_t min_heap = heap_caps_get_minimum_free_size(MALLOC_CAP_8BIT);
        ESP_LOGI("MEM_MONITOR", "Free Heap: %u bytes, Min Heap Record: %u bytes", free_heap, min_heap);

        if (free_heap < 15000) {
            ESP_LOGW("MEM_MONITOR", "[CRITICAL] Out of memory risk! Reclaiming network sockets and recycling stack...");
            mqtt_manager_stop();
            local_server_stop();
            vTaskDelay(pdMS_TO_TICKS(1000));
            esp_restart(); // Safe protective recycle
        }
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

