syaswanthkumar66-hash/iot/firmware/iotyk_esp32/main/main.cpp
// Background Monitor checking Internal CPU thermals (3-Tier protection)
static void thermal_monitor_task(void* pvParameters) {
#if HAS_TEMP_SENSOR
    temperature_sensor_handle_t temp_sensor = NULL;
    temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
    
    if (temperature_sensor_install(&temp_sensor_config, &temp_sensor) == ESP_OK) {
        temperature_sensor_enable(temp_sensor);
    }
#endif

    while (true) {
        float tsens_out = 32.0f; // Safe stable default core temperature
#if HAS_TEMP_SENSOR
        if (temp_sensor) {
            temperature_sensor_get_celsius(temp_sensor, &tsens_out);
        }
#endif
        int temp = (int)tsens_out;
        
        // Tier 1: Warning (65°C)
        if (temp >= 65 && temp < 75) {
            ESP_LOGW("THERMAL", "[WARNING] Chip core temperature elevated: %d C", temp);
        }
        // Tier 2: Throttled power-save activation (75°C)
        else if (temp >= 75 && temp < 85) {
            ESP_LOGW("THERMAL", "[THROTTLED] Activating Modem Sleep to limit thermal dissipation: %d C", temp);
            wifi_manager_set_power_save(true);
        }
        // Tier 3: High Temperature safe-shutdown / reboot protect (85°C)
        else if (temp >= 85) {
            ESP_LOGE("THERMAL", "[CRITICAL ALERT] Temperature exceeds safety threshold (%d C). Safe shutdown triggered!", temp);
            relay_controller_init(); // Safe lock outputs OFF
            vTaskDelay(pdMS_TO_TICKS(1000));
            esp_restart();
        }
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

extern "C" void app_main(void) {
    // 1. electrical boot rail voltage stabilization cushion delay
    vTaskDelay(pdMS_TO_TICKS(2000));

    // 2. Initialize redundant configs and database handles
    ESP_ERROR_CHECK(nvs_manager_init());
    relay_controller_init();
    
    io_tyk_config_t cfg;
    bool config_loaded = (nvs_manager_load_config(&cfg) == ESP_OK);

    // Dynamic Pin configuration initialization
    int count = relay_controller_get_count();
    
    // 3. Safe Relay Recovery State Restoration
    bool restore_flag = false;
    if (nvs_manager_get_bool("r_mask", &restore_flag, false) == ESP_OK && restore_flag) {
        bool val1, val2, val3, val4;
        nvs_manager_get_bool("r_val_1", &val1, false);
        nvs_manager_get_bool("r_val_2", &val2, false);
        nvs_manager_get_bool("r_val_3", &val3, false);
        nvs_manager_get_bool("r_val_4", &val4, false);
        
        if (count >= 1) relay_controller_set_state(0, val1);
        if (count >= 2) relay_controller_set_state(1, val2);
        if (count >= 3) relay_controller_set_state(2, val3);
        if (count >= 4) relay_controller_set_state(3, val4);
        ESP_LOGI(TAG, "Restored previous relay state outputs cleanly.");
    }

    xTaskCreate(indicator_task, "indicator_task", 2048, NULL, 2, NULL);
    wifi_manager_init();

    char device_id[64] = {0};
    nvs_manager_get_str(KEY_DEVICE_ID, device_id, sizeof(device_id), FACTORY_DEVICE_ID);
    if (strlen(device_id) == 0) {
        std::string fb = get_fallback_device_id();
        strcpy(device_id, fb.c_str());
    }

    // Challenge Nonce Handshake Generator
    uint8_t rand_bytes[16];
    esp_fill_random(rand_bytes, 16);
    for (int i = 0; i < 16; i++) {
        sprintf(&s_serial_nonce[i * 2], "%02X", rand_bytes[i]);
    }
    s_serial_nonce[32] = '\0';

    printf("\nDevice booted\n");
    printf("Device ID: %s\n", device_id);
    printf("CHALLENGE_NONCE:%s\n", s_serial_nonce);
    printf("Device Name: IoTYK Smart Relay\n");
    printf("Device started\n");

    bool is_provisioned = (config_loaded && strlen(cfg.wifi_ssid) > 0);
    if (is_provisioned) {
        ESP_LOGI(TAG, "Station provisioned. Linking to WiFi router: '%s'...", cfg.wifi_ssid);
        s_system_state = SYSTEM_STATE_CONNECTING;
        wifi_manager_connect_sta(cfg.wifi_ssid, cfg.wifi_pass);
        
        // Post-provisioning Lockdown
        lock_uart_rx();
    } else {
        ESP_LOGW(TAG, "Board unprovisioned. Initializing BLE setup.");
        printf("BLE onboarding mode started\n");
        s_system_state = SYSTEM_STATE_BLE_SETUP;
        ble_provision_start(device_id);
    }

    // Spawn serial thread listener only if not locked
    if (!is_provisioned) {
        xTaskCreate(serial_task, "serial_task", 4096, NULL, 5, NULL);
    }

    // Launch Heuristic monitors
    xTaskCreate(memory_monitor_task, "mem_monitor", 3072, NULL, 1, NULL);
    xTaskCreate(thermal_monitor_task, "thermal_monitor", 3072, NULL, 1, NULL);

    bool cloud_active = false;
    uint32_t conn_timestamp = 0;

    while (true) {
        bool online = wifi_manager_is_connected();

        if (online) {
            if (!cloud_active) {
                ESP_LOGI(TAG, "WiFi Connected successfully. Starting mDNS...");
                wifi_manager_start_mdns(device_id);

                char mqtt_u[64] = {0};
                char mqtt_p[64] = {0};
                if (config_loaded) {
                    strncpy(mqtt_u, cfg.temp_user, sizeof(mqtt_u) - 1);
                    strncpy(mqtt_p, cfg.temp_pass, sizeof(mqtt_p) - 1);
                }

                if (strlen(mqtt_u) == 0) {
                    nvs_manager_get_str(KEY_PERM_USER, mqtt_u, sizeof(mqtt_u), FACTORY_PERM_MQTT_USER);
                    nvs_manager_get_str(KEY_PERM_PASS, mqtt_p, sizeof(mqtt_p), FACTORY_PERM_MQTT_PASS);
                }

                printf("MQTT connection initiated...\n");
                printf("Now connecting...\n");
                mqtt_manager_start(device_id, mqtt_u, mqtt_p, handle_command);
                local_server_start(handle_command);

                cloud_active = true;
                conn_timestamp = esp_log_timestamp();
                s_system_state = SYSTEM_STATE_CONNECTING;
            }

            static uint32_t last_status = 0;
            if (esp_log_timestamp() - last_status > 30000) {
                char payload[128];
                snprintf(payload, sizeof(payload), "{\"id\":\"%s\",\"status\":\"online\"}", device_id);
                char topic[128];
                snprintf(topic, sizeof(topic), "device/%s/status", device_id);
                mqtt_manager_publish(topic, payload, 1, false);
                last_status = esp_log_timestamp();
            }

            if (ble_provision_is_active() && (esp_log_timestamp() - conn_timestamp > 60000)) {
                ESP_LOGI(TAG, "WiFi remains connected. Deactivating BLE setup beacon.");
                ble_provision_stop();
            }

            if (mqtt_manager_is_connected()) {
                if (s_system_state != SYSTEM_STATE_CONNECTED) {
                    s_system_state = SYSTEM_STATE_CONNECTED;
                }
            } else {
                if (s_system_state == SYSTEM_STATE_CONNECTING && (esp_log_timestamp() - conn_timestamp > 15000)) {
                    s_system_state = SYSTEM_STATE_LOCAL_ONLY; // Promote to LOCAL_ONLY on LAN
                    printf("[ERROR] MQTT connection failed - Local control active.\n");
                }
            }
        } else {
            if (cloud_active) {
                ESP_LOGW(TAG, "WiFi connection broken! Halting services & re-enabling BLE beacon fallback.");
                mqtt_manager_stop();
                local_server_stop();
                ble_provision_start(device_id);
                cloud_active = false;
                s_system_state = SYSTEM_STATE_CONNECTING;
            }

            if (wifi_manager_has_failed()) {
                if (s_system_state != SYSTEM_STATE_WIFI_ERROR) {
                    s_system_state = SYSTEM_STATE_WIFI_ERROR;
                    printf("[ERROR] WiFi connection failed. Re-activating BLE setup mode...\n");
                    ble_provision_start(device_id);
                }
            }
        }

        vTaskDelay(pdMS_TO_TICKS(2000));
    }
}
